soap/spyne-soap/wsdl.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:wsdlsoap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap11env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding" xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:tns="spyne.examples.hello" xmlns:s0="soap_models" targetNamespace="spyne.examples.hello" name="Application"><wsdl:types><xs:schema targetNamespace="spyne.examples.hello" elementFormDefault="qualified"><xs:import namespace="soap_models"/><xs:complexType name="stringArray"><xs:sequence><xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_hello"><xs:sequence><xs:element name="name" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="times" type="xs:integer" minOccurs="0" nillable="true"/><xs:element name="date" type="xs:dateTime" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="search_trains"><xs:sequence><xs:element name="departure_station" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="arrival_station" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="seat_classes" type="tns:stringArray" minOccurs="0" nillable="true"/><xs:element name="date" type="xs:dateTime" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_helloResponse"><xs:sequence><xs:element name="say_helloResult" type="s0:CustomModelArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="search_trainsResponse"><xs:sequence><xs:element name="search_trainsResult" type="s0:TrainArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="stringArray" type="tns:stringArray"/><xs:element name="say_hello" type="tns:say_hello"/><xs:element name="search_trains" type="tns:search_trains"/><xs:element name="say_helloResponse" type="tns:say_helloResponse"/><xs:element name="search_trainsResponse" type="tns:search_trainsResponse"/></xs:schema><xs:schema targetNamespace="soap_models" elementFormDefault="qualified"><xs:complexType name="CustomModel"><xs:sequence><xs:element name="name" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="Train"><xs:sequence><xs:element name="departure_station" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="arrival_station" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="departure_time" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="CustomModelArray"><xs:sequence><xs:element name="CustomModel" type="s0:CustomModel" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="TrainArray"><xs:sequence><xs:element name="Train" type="s0:Train" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:element name="CustomModel" type="s0:CustomModel"/><xs:element name="Train" type="s0:Train"/><xs:element name="CustomModelArray" type="s0:CustomModelArray"/><xs:element name="TrainArray" type="s0:TrainArray"/></xs:schema></wsdl:types><wsdl:message name="say_hello"><wsdl:part name="say_hello" element="tns:say_hello"/></wsdl:message><wsdl:message name="say_helloResponse"><wsdl:part name="say_helloResponse" element="tns:say_helloResponse"/></wsdl:message><wsdl:message name="search_trains"><wsdl:part name="search_trains" element="tns:search_trains"/></wsdl:message><wsdl:message name="search_trainsResponse"><wsdl:part name="search_trainsResponse" element="tns:search_trainsResponse"/></wsdl:message><wsdl:service name="HelloWorldService"><wsdl:port name="Application" binding="tns:Application"><wsdlsoap11:address location="http://localhost:8050/"/></wsdl:port></wsdl:service><wsdl:service name="SearchTrainsService"><wsdl:port name="Application" binding="tns:Application"><wsdlsoap11:address location="http://localhost:8050/"/></wsdl:port></wsdl:service><wsdl:portType name="Application"><wsdl:operation name="say_hello" parameterOrder="say_hello"><wsdl:input name="say_hello" message="tns:say_hello"/><wsdl:output name="say_helloResponse" message="tns:say_helloResponse"/></wsdl:operation><wsdl:operation name="search_trains" parameterOrder="search_trains"><wsdl:input name="search_trains" message="tns:search_trains"/><wsdl:output name="search_trainsResponse" message="tns:search_trainsResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><wsdlsoap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="say_hello"><wsdlsoap11:operation soapAction="say_hello" style="document"/><wsdl:input name="say_hello"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="say_helloResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="search_trains"><wsdlsoap11:operation soapAction="search_trains" style="document"/><wsdl:input name="search_trains"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="search_trainsResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>